popoC/msp430/半圓形馬達控制板/main - ----20101012 加入SD前-------.cpp
}
//-----------------------------------------------------------------------------------
void PwmSet(){
  TBCCR0 = 8000000/frequency_pwm;                           // PWM Period
    TBCCTL2 = OUTMOD_7;                         //  reset/set
    TBCCR2 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
    TBCCTL3 = OUTMOD_7;                         //  reset/set
    TBCCR3 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
    TBCCTL4 = OUTMOD_7;                         //  reset/set
    TBCCR4 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
    TBCCTL5 = OUTMOD_7;                         //  reset/set
    TBCCR5 =   ((100-percent_pwm)* (8000000/frequency_pwm))/100; //  PWM duty cycle
}

void MotoControl_Run(int ch,int cw_ccw){
  switch(ch){
  case 1:
    if(cw_ccw==CW){P4SEL |= BIT2; P4OUT |=BIT3;}
    else          {P4SEL |= BIT3; P4OUT |=BIT2;}
    break;  
  case 2:
    if(cw_ccw==CW){P4SEL |= BIT4; P4OUT |=BIT5;}
    else          {P4SEL |= BIT5; P4OUT |=BIT4;}
    break;
  }
}
void MotoControl_Stop(int ch){
  switch(ch){
  case 1:
    P4SEL &= ~(BIT2+BIT3);
    P4OUT &= ~(BIT2+BIT3);
    break;  
  case 2:
    P4SEL &= ~(BIT4+BIT5);
    P4OUT &= ~(BIT4+BIT5);
    break;
  }
}

//------------------------------------------------------------------
  void TDCM3_Init(){
    P2DIR |=(BIT6+BIT7);
    P2OUT |= TDCM3_RX;
    P2OUT |= TDCM3_RTS;   
  }

  void TDCM3_Enable(){
    
      if(TDCM3_Calibration){
      
        P2OUT &= ~TDCM3_RX;
        P2OUT &= ~TDCM3_RTS;   //--開始
          for(delay1=0;delay1<1000;delay1++);   //---- 800條指令約 1ms

        P2OUT |= TDCM3_RTS;   //--

        tdcm3_N = 0;
        
        for(delay1=0;delay1<50;delay1++)
        for(delay2=0;delay2<800;delay2++);

        if((TDCM3_Buff[0]==0x41)&&(TDCM3_Buff[1]==0x43)&&(TDCM3_Buff[2]==0x4B)){
          for(delay1=0;delay1<250;delay1++)
          for(delay2=0;delay2<800;delay2++);        //---此處.250ms的時間..旋轉吧~~~~
        }
        else{
          TDCM3_Calibration = true; 
        }
        
       P2OUT |= TDCM3_RX;        
       

       tdcm3_N = 0;
       
          for(delay1=0;delay1<100;delay1++)
          for(delay2=0;delay2<800;delay2++);

       if((TDCM3_Buff[0]==0x52)&&(TDCM3_Buff[1]==0x44)&&(TDCM3_Buff[2]==0x59)){

         TDCM3_Calibration = false;         
       }
       else{
         TDCM3_Calibration = true;
       }

       
       
     }
     else{
         P2OUT |= TDCM3_RX;
         P2OUT &= ~TDCM3_RTS;   //--開始
      
        for(delay1=0;delay1<1000;delay1++);   //---- 800條指令約 1ms

         P2OUT |= TDCM3_RTS;   //--
     
         tdcm3_N = 0;          //---- 開始收資料
 
      for(delay1=0;delay1<50;delay1++)
      for(delay2=0;delay2<800;delay2++);
      
      if(TDCM3_Buff[0]==0x80){

        TDCM3_status = TDCM3_Buff[0];     
        TDCM3_Heading =  (TDCM3_Buff[1]*256+TDCM3_Buff[2])/2;
        
        TDCM3_Calibration = false;
      }
      if(TDCM3_Buff[0]==0x81){
  
        TDCM3_status = TDCM3_Buff[0];     
        TDCM3_Heading =  (TDCM3_Buff[1]*256+TDCM3_Buff[2])/2;
        
        TDCM3_Calibration = true;   //--需要校正
      }
   
  }
}

// UART0 RX ISR will for exit from LPM3 in Mainloop
#pragma vector=UART0RX_VECTOR
__interrupt void usart0_rx (void)
{
   TDCM3_Buff[tdcm3_N] = RXBUF0;
       tdcm3_N++;
      if(tdcm3_N>5)tdcm3_N=0;   
}
//------------------------------------------------------------------
//-------------------------中斷-------------------------------------------------
#pragma vector=UART1RX_VECTOR
__interrupt void usart1_rx (void)
{
       command[coMMand_N] = RXBUF1;
       coMMand_N++;

       if(command[coMMand_N-1]==0x1B){      //  ESC
         coMMand_Mode = 0;          coMMand_N = 0;
         return;
       }
       if (command[coMMand_N-1]==0x0D){     // Enter
           switch(coMMand_Mode){
           case 0:
               if(command[0] == 'k'){ 

                 coMMand_Mode = 99;
            //    string[0] = '\r' ;string[1] = '\n' ;  
            sprintf(string,"please select the function \r\n");                  UART1_SendStr(string);
            sprintf(string," ------V3.10------\r\n");                                UART1_SendStr(string);
            sprintf(string,"1. 控制模式((手動=0 自動回歸原點=1 %04d \r\n",ControlMode);       UART1_SendStr(string);
            sprintf(string,"2. 角度AD平均次數 = %04d \r\n",AD_AVGtime);            UART1_SendStr(string);
            sprintf(string,"3. 馬達轉動後讀取AD之延遲時間 = %04d \r\n",motor_T_AD);             UART1_SendStr(string);
            sprintf(string,"4. 原點_X = %04d \r\n",Set_OriginX);           UART1_SendStr(string);
            sprintf(string,"5. 原點_Y= %04d \r\n",Set_OriginY);            UART1_SendStr(string);
            sprintf(string,"6. 移動1度所需時間(請依據馬達特性修改 = %04d  \r\n",move1deg_T);            UART1_SendStr(string);
            sprintf(string,"7. pwm_頻率 = %06d \r\n",frequency_pwm);       UART1_SendStr(string);
            sprintf(string,"8. pwm_百分比 = %05d (0~100) \r\n",percent_pwm);   UART1_SendStr(string);
            sprintf(string,"9. 自動找尋原點次數 = %05d (0~5000) \r\n",RunTime);        UART1_SendStr(string);
            sprintf(string,"a. 手動控制 移動X軸時間 = %05d (0~65000) \r\n",Hand_X_Time);UART1_SendStr(string);
            sprintf(string,"b. 手動控制 移動X軸方向 = %05d (0~65000) \r\n",Hand_X_Dir); UART1_SendStr(string);
            sprintf(string,"w. 手動控制 移動Y軸時間 = %05d (0~65000) \r\n",Hand_Y_Time);UART1_SendStr(string);
            sprintf(string,"d. 手動控制 移動Y軸方向 = %05d (0~65000) \r\n",Hand_Y_Dir); UART1_SendStr(string);

            sprintf(string,"e. 第一次啟動時間 = %05d (0~65000) 秒\r\n",FirstStart_Sec);UART1_SendStr(string);
            sprintf(string,"f. 每隔%02d小時重新啟動                \r\n",ReStart_Day); UART1_SendStr(string);
            sprintf(string,"g. 倒數暫停 (0暫停 1繼續 ) \r\n");UART1_SendStr(string);

            sprintf(string," --------------------\r\n");         UART1_SendStr(string);
               }  
             
               break;
           case 99:
             
                coMMand_Mode  =  command[0];
              switch(coMMand_Mode){
               case '1':             
                    sprintf(string," ControlMode  = (預設為1");       UART1_SendStr(string);
                break;
               case '2':
                    sprintf(string," AD_AVGtime    =   ");             UART1_SendStr(string);
                break;
               case '3':
                    sprintf(string," motor_T_AD =   ");             UART1_SendStr(string);
                break;
               case '4':
                    sprintf(string," Set_OriginX=   ");             UART1_SendStr(string);
                break;
               case '5':
                    sprintf(string," Set_OriginY =   ");        UART1_SendStr(string);
                break;
               case '6':
                    sprintf(string," move1deg_T =   ");        UART1_SendStr(string);
                break;
               case '7':
                    sprintf(string," frequency_pwm =   ");      UART1_SendStr(string);
                break;
               case '8':
                    sprintf(string," percent_pwm =   ");       UART1_SendStr(string);
                break;
               case '9':
                    sprintf(string," RunTime =   ");       UART1_SendStr(string);
                break;
               case 'a':
                    sprintf(string," Hand_X_Time =   ");       UART1_SendStr(string);
                break;
               case 'b':
                    sprintf(string," Hand_X_Dir =   ");       UART1_SendStr(string);
                break;
               case 'w':
                    sprintf(string," Hand_Y_Time =   ");       UART1_SendStr(string);
                break;
               case 'd':
                    sprintf(string," Hand_Y_Dir =   ");       UART1_SendStr(string);
                break;
               case 'e':
                    sprintf(string," FirstStart_Sec =   ");       UART1_SendStr(string);
                break;
               case 'f':
                    sprintf(string," ReStart_Day =   ");       UART1_SendStr(string);
                break;
               case 'g':
                    sprintf(string," 0 oR 1 =   ");       UART1_SendStr(string);
                break;
                
