popoC/msp430/半圓形馬達控制板/main - ----20101012 加入SD前-------.cpp
              }
              break;
           case '1':
              ControlMode =GetInputVal(coMMand_N);
              break;
           case '2':
              AD_AVGtime = GetInputVal(coMMand_N);              write_flash_segA();
             break;
           case '3':
              motor_T_AD = GetInputVal(coMMand_N);              write_flash_segA();
             break;
           case '4':
              Set_OriginX = GetInputVal(coMMand_N);
              if(Set_OriginX !=0)Set_OriginX_flag = 1;        _BIC_SR_IRQ(LPM0_bits);                        
             break;
           case '5':
              Set_OriginY = GetInputVal(coMMand_N);
              if(Set_OriginY !=0)Set_OriginY_flag = 1;        _BIC_SR_IRQ(LPM0_bits); 
             break;
           case '6':
              move1deg_T = GetInputVal(coMMand_N);               write_flash_segA();              
             break;
           case '7':
             frequency_pwm = GetInputVal(coMMand_N);             write_flash_segA();  
             break;
           case '8':
             percent_pwm = GetInputVal(coMMand_N);               write_flash_segA();  
             break;
           case '9':
             RunTime = GetInputVal(coMMand_N);                   write_flash_segA();  
             break;             
           case 'a':
             Hand_X_Time = GetInputVal(coMMand_N);
             break;
           case 'b':
             Hand_X_Dir = GetInputVal(coMMand_N);
             break;
           case 'w':
             Hand_Y_Time = GetInputVal(coMMand_N);
             break;
           case 'd':
             Hand_Y_Dir = GetInputVal(coMMand_N);
             break;

           case 'e':
             FirstStart_Sec = GetInputVal(coMMand_N);            write_flash_segA();  
             break;
           case 'f':
             ReStart_Day = GetInputVal(coMMand_N);               write_flash_segA();   
             break;
           case 'g':
             startCount = GetInputVal(coMMand_N);
             break;
             
           }
           coMMand_N = 0;
       }

}
//-------------------------------------------------------------------------------------
